{
    "title": "Bachelor of Information and Communication Technology (P3T)",
    "overview": "With a focus on providing you with the skills to compete for employment in the ICT industry globally, a Bachelor of Information and Communication Technology (BICT) gives you the knowledge and ability to stand out in the constantly changing technology landscape.\nThis is a specialist degree with both a theoretical and practical focus, developing technological understanding and skills that are in high demand world-wide, plus builds project management and other business soft-skills that make you an ICT professional.\nYou'll develop knowledge and capabilities in communication, design, development and management and learn what it takes to implement and integrate ICT within an organisation. You will also complete a hands-on project that gives you real-world experience before you even start your career.\nYou will graduate with the skills and knowledge to grow into leadership positions; the drive to act on entrepreneurial ambition; and the confidence to pursue research and graduate studies.\nMajors available\nHobart\nLaunceston\nMelbourne*\nUltimo*\nArtificial Intelligence\nArtificial Intelligence is available in Hobart\nArtificial Intelligence is available in Launceston\nArtificial Intelligence is available in Melbourne\nArtificial Intelligence is available in Ultimo\nApplication and Web Development\nApplication and Web Development is available in Hobart\nApplication and Web Development is available in Launceston\nApplication and Web Development is available in Melbourne\nApplication and Web Development is available in Ultimo\nGames and Creative Technology\nGames and Creative Technology is available in Hobart\nGames and Creative Technology is available in Launceston\nGames and Creative Technology is not available in Melbourne\nGames and Creative Technology is not available in Ultimo\nNetworks and Cybersecurity\nNetworks and Cybersecurity is available in Hobart\nNetworks and Cybersecurity is available in Launceston\nNetworks and Cybersecurity is not available in Melbourne\nNetworks and Cybersecurity is not available in Ultimo\n*The\nMelbourne study centre\nand\nUltimo study centre\nare available to international students only.\nCatalyst Program\nWant to combine your degree with overseas trips, summer research programs, scholarships and special events? Our Catalyst Program offers domestic high achieving school leavers all this and more.\nAll domestic students with an ATAR of 90 or greater, enrolled in a range of STEM courses will be awarded a $3,000 Catalyst Scholarship. Across the program students can access scholarships of up to $14,500 in value, and gain experience that will make you stand out in your chosen field.\nLearn more about the Catalyst program\n.\nJoin our webinar (International students)\nIn this session, the course coordinators for both the Bachelor of ICT and the Master of ICT will discuss how these degrees will give your students a high level of technical expertise to enable them to succeed as an information technology or systems professional in any industry.\nWatch now (YouTube)\nThis degree can be combined to form a double degree. Study what you want,\nexplore your options\nand find out how you can accelerate your career.",
    "duration": "Minimum 3 years, up to a maximum of 7 years.",
    "course_objectives": "This degree offers core knowledge and specialist units across the full spectrum of computing and information technology, including:\nNon-technical areas such as the nature of information and the organisational need for ICT\nHardware, software, networking, and creative technologies used to meet these needs\nSpecialist topics such as immersive technologies, artificial intelligence, cybersecurity principles and practices, and web, mobile, and application development\nCommunication, design, development, and management skills for creating and implementing ICT solutions\nYou’ll also develop key organisational and professional skills, including:\nWorking both independently and as part of a team\nDeveloping user-centred solutions\nCommunicating effectively\nSolving problems\nDemonstrating community and social awareness\nUpholding professional conduct and industry best practice",
    "learning_outcomes": "1 Communicate to a range of stakeholders in ICT professional practice with the ability to display initiative and competence when working alone or as part of a team.\n2 Manage data, information, and knowledge securely by selecting, adapting, and applying ICT processes, techniques, and tools.\n3 Analyse and evaluate the efficacy of ICT cognisant of economic, social, legal, and ethical factors and the consequences for individuals, organisations, and society.\n4 Apply ICT principles, processes, tools, and techniques using best practice ICT industry standards and adhering to codes of professional conduct.\n5 Construct efficient solutions in an area of specialisation through determining the requirements and exercising computational, creative, and critical thinking.",
    "practical_experience": "Your learning experience goes beyond lectures, labs and tutorials. The teaching environment at the University of Tasmania aims to provide a distinctive, energising and rewarding university experience for all students.\nLed by experienced and approachable staff, your learning could also include an international study exchange, valuable industry placement and practical project work. We provide extensive teaching laboratory facilities that deliver valuable hands-on experience in all technology specialisations. Students also experience the latest in technology development and application through challenging team projects.\nICT Project & Industry Experience\nThe University has active relationships with the Tasmanian business community. In the final year of the BICT, students obtain practical work experience during a full-year project in which you design, engineer and implement ICT solutions to real industry problems. This is a fully commercialised process, dealing with management, stakeholders, planning, development and execution.\n\"Our ICT Project was to create a mobile based game for local game developer, Secret Lab. I want to be a project manager, and the ICT Project units helped match my expectations to reality.\"\nRyan Ward, graduate\nHITLab AU\nHuman Interface Technology Laboratory (HITLab) is a research and teaching facility located on the Newnham campus in Launceston. The HITLab is focused on building advanced human-computer interface technology. It allows us to explore new forms of interface technology made possible by infrastructures such as the NBN and Ubiquitous Computing to realise interfaces in the wild.\nSpecial facilities in the HITLab include Surface Research equipment, in particular the VisionSpace, a three-screen immersive stereo projection system enabling groups of people to view and interact intuitively with virtual 3D data; and an Access Grid, a high-end, collaborative communication facility including HD videoconferencing capabilities. Students have opportunities to undertake elective units or develop projects using HITLab AU.\nCatalyst Program and Dean's Summer Research Scholarship\nThe Catalyst Program is available to high achieving domestic high school leavers studying a STEM course. It combines your bachelor's degree with scholarships, extracurricular experiences, special events, and networking opportunities. As a Catalyst scholarship recipient, you can participate in the\nDean’s Summer Research Scholarship (DSRS)\nthree times throughout your degree, with up to $9,000 in scholarships. Non-Catalyst students may also undertake the DSRS with a scholarship payment of $2,000 per experience.\nAs a Bachelor of Information and Communication Technology student, you can take advantage of additional benefits such as access to work-integrated learning opportunities or research projects. Learn more about the\nCatalyst program\n.",
    "work_placement": "You will also have the option of undertaking an elective unit at the end of your second year to do a six week industry placement, providing you with industry experience in your chosen ICT field. Our close connections with Tasmania's vibrant and dynamic ICT industry means there are opportunities across a wide spectrum of ICT companies, plus ICT roles in other organisations.",
    "career_outcomes": "Information and Communication Technology is a core function of industries all over the world. It contributes to everything from maintaining a company’s daily operations, to eScience, productivity gains, innovation, expansion, and job growth. This gives you truly global job opportunities, allowing you to forge a great career wherever your interests take you.\nThis is a career that rewards professionals who can take initiative and work independently, and rewards those who can multi-task and adapt. It is great for people who like to lead, as well as those who like operating in a team environment.\nCareer Opportunities with ICT\nYou’ll often start out in a technical role where you can apply your skills and build on the industry experience you gain during your studies. These roles include:\nSoftware programmer\nNetwork administrator\nSystems or business analyst\nWeb designer/developer\nWith 3–5 years’ experience, your technical role can progress into a management or leadership position, setting you up for a long-term career. These positions may include:\nProject manager\nBusiness analyst\nTesting, network, or systems manager\nDatabase administrator\nSecurity specialist\nCareers relating to technology are growing, with employers demanding technical expertise across a wide variety of different industries. Here are some of the top jobs projected to grow in the next five years.\nComputer System Design and Related Services is expected to grow 17.6% by 2024\n*\n.\nThe employment demand for ICT workers is forecast to grow by 100,000 between 2018 and 2024. Citation:\nACS Australia’s Digital Pulse 2019 report\n* ABS Labour Force Survey, National Skills Commission trend data to May 2019 and projections to 2024.\nProfessional Accreditation\nThe Bachelor of Information and Communication Technology is an externally accredited degree.\nCompletion of the course meets the requirements for membership of the Australian Computer Society. There may be additional requirements for membership beyond the completion of the course.\nFor further membership requirements, please visit the\nACS\nwebsite.\nIf you have any queries about the accreditation process, please\ncontact us\nfor further information.",
    "entry_requirements": {
        "For Domestic students": "We encourage you to apply for the courses you most want to study. If you are not eligible to enter your chosen course right now, the University's admissions team will work with you to find the best pathway option.\nEnquire online\nfor more advice on the application process and the available pathways to enrol and study at the University of Tasmania.\nSchools Recommendation Program\nAustralian year 12 students can apply for this course via our\nSchools Recommendation Program (SRP)\n. Rather than an ATAR, your application is based on a recommendation by your school teachers. This can factor in your year 11 results, an assessment of your capabilities, and other considerations.\nThrough the SRP, you can receive and accept an offer prior to completing year 12. You will still need to finish your year 12 studies – including any exams – to commence your studies.\nIf you don’t receive an offer for this course through the Schools Recommendation Program, you will be re-assessed for a higher preference offer once your ATAR is released.\nDomestic applicants who recently completed secondary education\nApplicants are ranked by ATAR and offers are made based on the number of places available.  This course has a Guaranteed ATAR of 65.\nIn 2025, the lowest ATAR to receive an offer into this course was 65.55. The lowest ATAR to receive an offer may change from year to year based on the number of applications we receive.\nApplicants who have recently completed senior secondary studies but have not received an ATAR may still be eligible for admission. We will consider your individual subject results on a case-by-case basis when we assess your application.\nDomestic applicants with higher education study\nTo be eligible for an offer, applicants must have:\nPartially completed an undergraduate course at Diploma level or higher (or equivalent). Applicants must have completed at least two units of study (equivalent to 25 University of Tasmania credit points). If an applicant has failed any units, the application may be subject to further review before an offer is made; OR\nCompleted the University of Tasmania University Preparation Program (or an equivalent qualification offered by an Australian university).\nDomestic applicants with VET / TAFE study\nTo be eligible for an offer, applicants must have completed a Certificate IV (or equivalent) in any discipline.\nDomestic applicants with work and life experience\nApplicants without senior secondary, tertiary or VET / TAFE study can complete a\npersonal competency statement\n.\nApplicants may be eligible for an offer if they have relevant work and/or life experiences which demonstrate a capacity to succeed in this course.\nSPECIAL CONSIDERATION\nWe believe university education should be an option for everyone, no matter your background. If your ability to access or participate in education has been affected by circumstances beyond your control, you can\napply for special consideration\nas part of your application. We will consider a range of factors, including economic hardship, a serious medical condition, or disability.\nWe can only approve applications for special consideration if we are confident that you have the necessary skills and knowledge to succeed in your studies. If your application is not approved, the University admissions team will work with you to find the best alternative pathway to your chosen course. Special consideration is not available for international applicants.\nCOURSE PARTICIPATION REQUIREMENTS\nThis course includes compulsory Work Integrated Learning (professional experience placements). In order to participate in placements, all students must:\nComplete a Safe to Practice Agreement declaring they have the medical, physical or psychological capacity to safely participate in professional experience practice.",
        "For International students": "All international students will need to meet the minimum English Language Requirements, University General Entry Requirements and any course specific requirements such as pre-requisite subjects, if applicable.\nEnglish Language Requirements\nThis degree requires an IELTS (Academic) of 6.0, with no individual band less than 5.5, or a PTE Academic score of 50, with no score lower than 42 or equivalent.\nFor students who do not meet the English Language Requirement through citizenship or prior studies in English in an approved country, evidence of an approved English language test completed within the last 2 years must be provided.\nSee the\nEnglish Language Requirements\npage for more information.\nGeneral Entry Requirements\nAdmission to undergraduate courses at the University of Tasmania requires the completion of qualifications equivalent to a year 12 education in Australia.\nPlease review the\nequivalent undergraduate entry requirements\nto see the minimum requirement relevant to your country. The ATAR information for this course is located in the “For Domestic Students” section of the entry requirements on this page.\nYou can also meet the General Entry Requirement for this course with the following qualifications or prior studies:\nCompletion of an equivalent AQF Certificate IV or above\nComplete or incomplete (minimum 25 credit points) of previous tertiary study at Diploma level or higher\nIf you do not meet the minimum requirements, we offer the\nFoundation Studies Program\nand\nX1D International First Year Diploma (Science)\n.\nCOURSE PARTICIPATION REQUIREMENTS\nThis course includes compulsory Work Integrated Learning (professional experience placements). In order to participate in placements, all students must:\nComplete a Safe to Practice Agreement declaring they have the medical, physical or psychological capacity to safely participate in professional experience practice.",
        "Credit transfer": "How to apply for a credit transfer\nApplications for credit can be made in your course application. Find out more information about how to apply for a credit transfer/advanced standing at\nRecognition of Prior Learning\n.\nTalk to us on 13 8827 or enquire online about your credit transfer.",
        "Articulation": "Articulation into the Bachelor of Information and Communication Technology\nTAFE/VET qualifications\nIf you’ve completed one of the VET qualifications listed below you are guaranteed both entry and credit into the Bachelor of Information and Communication Technology.\nCode\nQualification title\nRelevant P3T majors\nCredit given\nICT50220\nDiploma of Information Technology\nAny major\n100 credit points (1 year)\nIn addition to these formal agreements, we also offer credit for a wide range of other VET qualifications. Generally, you can gain credit for your TAFE/VET study if:\nIt’s in a similar study area as your proposed university study,\nIs at Diploma of Advanced Diploma level, and\nIt was completed no more than 10 years ago.\nVisit our\nTAFE and VET students website\nto learn more about articulation, and how to apply for credit into this degree.\nArticulation from the Bachelor of Information and Communication Technology\nSuccessful completion of the Bachelor of Information and Communication Technology, with a Distinction average for at least 50% credit points of advanced (level 300) units from their ICT related major, will allow articulation into the Bachelor of Information and Communication Technology (Honours) degree.",
        "Alternative entry pathways": "If you have not completed senior secondary studies or equivalent studies in Mathematics, we recommend you speak with a course advisor about preparatory unit options. Additionally, students who do not have recent experience using computers to create, manage, and share files such as documents, images, spreadsheets, and presentations should speak with a course advisor about preparatory unit options.\nAs a school leaver, if you do not meet the minimum ATAR\nyou should consider enrolment in the Diploma of University Studies as a pathway to the Bachelor of Information and Communication Technology.\nDiploma of University Studies\nAs a mature age student, if you do not meet the General Entry Requirements (GER),\nyou should consider enrolment in the Diploma of University Studies or the University Preparation Program.\nDiploma of University Studies\nUniversity Preparation Program\nIn all cases, you can\ncontact us\nto discuss an option best suited to your needs.",
        "Detailed Admissions Information": "Detailed admissions information and advice for all undergraduate courses, including comprehensive, course-level student profiles, is available from\nUTAS Admissions\n."
    },
    "fees": {
        "Domestic students": "Options for this course\nCost shouldn’t get in the way of you studying.\nCommonwealth supported places (CSP) are available for this course. For eligible domestic undergraduate students, this means your fees will be subsidised by the Australian Government. You’ll only need to pay the\nstudent contribution amount\nfor each unit you study within the course.\nYou can find the student contribution for each unit of study on the individual unit pages. The units for this course are found in the\ncourse structure\nsection.\nYou may also be able to defer payment of the student contribution amount by accessing a HECS-HELP loan from the Government. If eligible, you’ll only have to pay your tuition fees once you start earning above a specific amount.\nFurther information on student loans and a CSP eligibility checker can be found at\nAustralian Government Study Assist\n.\nFurther information\nDetailed fee information for domestic students including the Student Services and Amenities Fee (SSAF) is available at\nScholarships, fees and costs\n.",
        "International students": "2026 Total Tuition Fee (international students):\n$125,619 AUD*\n.\nTuition fee based on a rate of\n$39,848 AUD per standard, full-time year of study (100 credit points).\n* Please note that this is an\nindicative fee\nonly.\n\nInternational students are charged the Student Services and Amenities Fee but this fee is incorporated in the annual rate.  International students do not have to make any additional SSAF payments.",
        "Scholarships": "Domestic Students\nEach year, the University offers more than 900 awards to students from all walks of life, including: those who have achieved high academic results, those from low socio-economic backgrounds, students with sporting ability, students undertaking overseas study, and students with a disability.\nFor information on all scholarships available at the University of Tasmania, please visit the\nscholarships website\n.\nApplications\nfor most awards commencing in Semester 1 open at the beginning of August and close strictly on 31 October in the year prior to study.\nCatalyst Program\nWant to combine your degree with overseas trips, summer research programs, scholarships and special events? Our Catalyst Program offers domestic high achieving school leavers all this and more.\nAll domestic students with an ATAR of 90 or greater, enrolled in a range of STEM courses will be awarded a $3,000 Catalyst Scholarship. Across the program students can access scholarships of up to $14,500 in value, and gain experience that will make you stand out in your chosen field.\nLearn more about the Catalyst Program\nInternational students\nThere are a huge range of scholarships, bursaries and fee discounts available for international students studying at the University of Tasmania. For more information on these, visit the\nInternational Scholarships\nwebsite."
    },
    "course_structure": {
        "Description": "The Bachelor of Information and Communication Technology requires the completion of 300 credit points comprising:\nA majoris an area of focus in your degree. During your studies, you’ll choose an area that interests you, and then study a group of units related to that area. Find out more atWhat is a Major?\nFor yourmajor, you may select from one of the majors below.\nAll students study a set ofcoreunits developing the skills and knowledge required to be an ICT Professional.\nIn yourelectivecomponent you can choose from any units marked as \"Student Electives\" which you meet the pre-requisites for, at any level, from across the university.\nYour electives can be used to add breadth to your degree, by exploring a variety of different subject areas from within or outside the College of Sciences and Engineering. Alternatively, you can deepen your engagement with specific subject areas, for example, by completing additional units in the same discipline as your major or related fields.\nYou can also use this space to complete an optional second major which may be a (i) *second disciplinary major, (ii) asustainability major, or (iii) *another major from across the institution, noting some exclusions apply. (*to enrol in a second disciplinary major, or a major outside your discipline, please contact a Student Advisor via Uconnect)..\nWe have a team of Course Information Officers available to help you structure your studies to meet your desired outcomes.  For enrolment assistance please contact us viaU Connecttoday.",
        "Major": {
            "category_description": "Select one major from the following",
            "units": [
                {
                    "unit_code": "KIT103",
                    "unit_title": "Computational Science",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit103-computational-science?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "Computers and mathematics are powerful tools for modelling and reasoning about the world around us. They are also powerful tools for reasoning about computation itself. This unit explores the fundamental topics of sets, logic, combinatorics and number theory as they…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT107",
                    "unit_title": "Programming",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit107-programming?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit extends the students' knowledge and experience of programming. It introduces dynamic data structures, foundational collection abstract data types, and computational algorithms and techniques. Programming is undertaken in Python and Java and topics include: references, memory management, self-referential data…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT205",
                    "unit_title": "Data Structures and Algorithms",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit205-data-structures-and-algorithms?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit extends the first year treatment in KIT107 of standard data structures and algorithms for solving computational problems. Topics include: data structures (such as balanced trees and hash tables) for collections, (binary heaps for) priority queues, sorting algorithms (e.g.…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT214",
                    "unit_title": "Intelligent and Secure Web Development",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit214-intelligent-and-secure-web-development?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "Cloud computing forms the backbone of many internet-based applications nowadays. These platforms use advanced operating systems and web service technologies to create and share information. Data stored and exchanged in this cloud-based application follow specific formats. The data exchange can…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT300",
                    "unit_title": "ICT Project",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit300-ict-project?year=2026",
                    "unit_credit_points": "25",
                    "unit_description": "The capstone project unit provides an opportunity for students to consolidate the knowledge and skills they have acquired in their course and apply them to a substantial ICT project. This unit extends the students development of the professional, technical, communication…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT305",
                    "unit_title": "Mobile Application Development",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit305-mobile-application-development?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit is concerned with the development of applications for mobile and ubiquitous computing platforms. Android, iOS, and cross-platform apps will be used as a basis for teaching programming techniques and design patterns related to the development of mobile and…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT328",
                    "unit_title": "Advanced Web Programming",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit328-advanced-web-programming?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit will cover advanced web technologies and front-end frameworks that form the basis of modern web application experiences. Students will learn about the role of frameworks in the full-stack development lifecycle and explore principles of DevOps (Development Operations) and…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT107",
                    "unit_title": "Programming",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit107-programming?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit extends the students' knowledge and experience of programming. It introduces dynamic data structures, foundational collection abstract data types, and computational algorithms and techniques. Programming is undertaken in Python and Java and topics include: references, memory management, self-referential data…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT108",
                    "unit_title": "Artificial Intelligence",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit108-artificial-intelligence?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "The unit provides an introduction to many AI sub-fields, including: expert systems, machine learning, natural language processing, computer vision, intelligent agents. Students will be exposed to state-of-the-art examples as well as emerging technologies and get practical experience of solving interesting…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT205",
                    "unit_title": "Data Structures and Algorithms",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit205-data-structures-and-algorithms?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit extends the first year treatment in KIT107 of standard data structures and algorithms for solving computational problems. Topics include: data structures (such as balanced trees and hash tables) for collections, (binary heaps for) priority queues, sorting algorithms (e.g.…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT217",
                    "unit_title": "Internet of Things and Distributed Artificial Intelligence",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit217-internet-of-things-and-distributed-artificial-intelligence?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "The Internet of Things (IoT) is a rising set of technologies that provides access to a large quantity of data through sensors. Such devices are ubiquitous today in industrial processes, vehicles, robots, environmental monitoring, farms, hospitals, and on our personal…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT300",
                    "unit_title": "ICT Project",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit300-ict-project?year=2026",
                    "unit_credit_points": "25",
                    "unit_description": "The capstone project unit provides an opportunity for students to consolidate the knowledge and skills they have acquired in their course and apply them to a substantial ICT project. This unit extends the students development of the professional, technical, communication…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT315",
                    "unit_title": "Machine Learning and Applications",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit315-machine-learning-and-applications?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "The aim of this unit is to provide students with the foundation knowledge and understanding of Machine Learning and its applications in various domains including computer vision, data analytics and text mining. This unit will equip students with essential knowledge…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT318",
                    "unit_title": "Big Data and Cloud Computing",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit318-big-data-and-cloud-computing?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "In recent years, due to advancement of internet technologies and instrumentation of every part of our life, we have noticed a huge surge in data available to us. This revolution is termed as Big Data. This Big Data cannot be…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT107",
                    "unit_title": "Programming",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit107-programming?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit extends the students' knowledge and experience of programming. It introduces dynamic data structures, foundational collection abstract data types, and computational algorithms and techniques. Programming is undertaken in Python and Java and topics include: references, memory management, self-referential data…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT109",
                    "unit_title": "Games Fundamentals",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit109-games-fundamentals?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "Games (whether they be video games, console games, computer games, mobile games, or web games) differ from other media as they elevate the viewer to the level of a participant. Games are an ever-growing cultural phenomenon which has increasing relevance…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT207",
                    "unit_title": "Game Design and Production",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit207-game-design-and-production?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit introduces the topic of game design and production. Students will work in teams to design and develop a prototype of their design using an agile development methodology. During the development process students will document aspects of the game's…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT208",
                    "unit_title": "Virtual and Mixed Reality Technology",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit208-virtual-and-mixed-reality-technology?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit will explore the exciting field of virtual reality, mixed reality and the advanced concepts and technologies for interfacing humans with complex machines. We will discuss their potential impact on the way we think about computers and the way…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT300",
                    "unit_title": "ICT Project",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit300-ict-project?year=2026",
                    "unit_credit_points": "25",
                    "unit_description": "The capstone project unit provides an opportunity for students to consolidate the knowledge and skills they have acquired in their course and apply them to a substantial ICT project. This unit extends the students development of the professional, technical, communication…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT307",
                    "unit_title": "Computer Graphics and Animation: Principles and Programming",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit307-computer-graphics-and-animation-principles-and-programming?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit will look at the creation and use of 2- and 3-dimensional graphical information and animations. The mathematical and algorithmic techniques used in generating computer graphics will be covered, as well as the programming methods to build the tools…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT327",
                    "unit_title": "Gamification and Serious Games",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit327-gamification-and-serious-games?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit will provide essential information on the growing field of gamification and serious games, as well as a practical opportunity to apply technical and behavioural methodologies to build a serious game to support a critical social issue.…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT107",
                    "unit_title": "Programming",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit107-programming?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit extends the students' knowledge and experience of programming. It introduces dynamic data structures, foundational collection abstract data types, and computational algorithms and techniques. Programming is undertaken in Python and Java and topics include: references, memory management, self-referential data…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT118",
                    "unit_title": "Introduction to Cybersecurity Policies and Practices",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit118-introduction-to-cybersecurity-policies-and-practices?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit explores cybersecurity as it is managed in the business context. It covers the processes of threat and risk analysis, security policy development, incident prevention and response, issues around privacy, professional codes of conduct, and looks at legislative efforts…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT215",
                    "unit_title": "CyberSecurity and Ethical Hacking",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit215-cybersecurity-and-ethical-hacking?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit gives an introduction to the risks and threats to computer systems and some of the countermeasures that can be put in place to minimise them. Students will develop an understanding of the ethical and privacy issues relating to…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT216",
                    "unit_title": "Network Administration and Security",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit216-network-administration-and-security?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit builds on the fundamentals of distributed networked environments explored in KIT111 Data Networks and Security and extends your knowledge of internetworking standards to consider advanced topics such as network scalability, quality of service, reliability and fault tolerance, efficiency,…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT300",
                    "unit_title": "ICT Project",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit300-ict-project?year=2026",
                    "unit_credit_points": "25",
                    "unit_description": "The capstone project unit provides an opportunity for students to consolidate the knowledge and skills they have acquired in their course and apply them to a substantial ICT project. This unit extends the students development of the professional, technical, communication…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT304",
                    "unit_title": "Server Administration and Security Assurance",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit304-server-administration-and-security-assurance?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit will provide students with a general introduction to system administration, and is comprised of four modules that explore the role of an administrator in modern business settings. The four modules cover Unix administration, Windows administration, web, database and…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT325",
                    "unit_title": "Advanced Cybersecurity and eForensics",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit325-advanced-cybersecurity-and-eforensics?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit focuses on the advanced concepts and implementations of cybersecurity solutions applied in organisational settings. The unit discusses cybersecurity frameworks and incident response processes from the applied perspective of security measures. Moreover, this unit provides a capstone-like experience through…",
                    "unit_availability": []
                }
            ]
        },
        "Application and Web Development": {
            "category_description": "This major provides an opportunity to deepen and strengthen your programming skills to construct complex software systems. You will gain the skills and knowledge to engineer standalone, mobile, networked, and web-based software systems.",
            "units": [
                {
                    "unit_code": "KIT103",
                    "unit_title": "Computational Science",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit103-computational-science?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "Computers and mathematics are powerful tools for modelling and reasoning about the world around us. They are also powerful tools for reasoning about computation itself. This unit explores the fundamental topics of sets, logic, combinatorics and number theory as they…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT107",
                    "unit_title": "Programming",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit107-programming?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit extends the students' knowledge and experience of programming. It introduces dynamic data structures, foundational collection abstract data types, and computational algorithms and techniques. Programming is undertaken in Python and Java and topics include: references, memory management, self-referential data…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT205",
                    "unit_title": "Data Structures and Algorithms",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit205-data-structures-and-algorithms?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit extends the first year treatment in KIT107 of standard data structures and algorithms for solving computational problems. Topics include: data structures (such as balanced trees and hash tables) for collections, (binary heaps for) priority queues, sorting algorithms (e.g.…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT214",
                    "unit_title": "Intelligent and Secure Web Development",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit214-intelligent-and-secure-web-development?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "Cloud computing forms the backbone of many internet-based applications nowadays. These platforms use advanced operating systems and web service technologies to create and share information. Data stored and exchanged in this cloud-based application follow specific formats. The data exchange can…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT300",
                    "unit_title": "ICT Project",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit300-ict-project?year=2026",
                    "unit_credit_points": "25",
                    "unit_description": "The capstone project unit provides an opportunity for students to consolidate the knowledge and skills they have acquired in their course and apply them to a substantial ICT project. This unit extends the students development of the professional, technical, communication…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT305",
                    "unit_title": "Mobile Application Development",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit305-mobile-application-development?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit is concerned with the development of applications for mobile and ubiquitous computing platforms. Android, iOS, and cross-platform apps will be used as a basis for teaching programming techniques and design patterns related to the development of mobile and…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT328",
                    "unit_title": "Advanced Web Programming",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit328-advanced-web-programming?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit will cover advanced web technologies and front-end frameworks that form the basis of modern web application experiences. Students will learn about the role of frameworks in the full-stack development lifecycle and explore principles of DevOps (Development Operations) and…",
                    "unit_availability": []
                }
            ]
        },
        "Year 1": {
            "category_description": "",
            "units": [
                {
                    "unit_code": "KIT101",
                    "unit_title": "Programming Fundamentals",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit101-programming-fundamentals?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit introduces fundamental programming skills, developing students' ability to think algorithmically to solve problems and to express their ideas in well-constructed Python code. Beginning with the fundamental characteristics of computers and how they represent information, the unit develops the…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT105",
                    "unit_title": "ICT Professional Practices",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit105-ict-professional-practices?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "An undergraduate student needs to acquire an understanding of the vast and diverse nature of the ICT industry to plan and manage a successful career. Students develop awareness of the skills, attributes, qualities and values required of ICT professionals. Students…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT111",
                    "unit_title": "Data Networks and Security",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit111-data-networks-and-security?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit introduces students to fundamentals of distributed networked environments, primarily focusing on wired networks but students will examine some of the different approaches in wireless networks. It provides knowledge of internetworking standards and understanding of the networking architecture, technology…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT119",
                    "unit_title": "Database Fundamentals",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit119-database-fundamentals?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit will familiarise you with the fundamental concepts of database design and implementation techniques to define, construct and query a database. In this unit you will develop basic skills in data modelling using relational data models and normalisation to…",
                    "unit_availability": []
                }
            ]
        },
        "Year 2": {
            "category_description": "",
            "units": [
                {
                    "unit_code": "KIT202",
                    "unit_title": "Web Programming Fundamentals",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit202-web-programming-fundamentals?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit introduces students to the technologies that make up the fabric of the web—HTML, CSS and JavaScript—as well as standard web models and practices, key web design and usability principles, common security issues and mitigation strategies, and data-driven backend…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT203",
                    "unit_title": "ICT Project Management and Modelling",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit203-ict-project-management-and-modelling?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit provides both a theoretical and practical overview of project management as it relates to technology-oriented projects. Specifically, this unit will introduce project management principles, techniques and tools that can be used to guide traditional business-oriented ICT projects, as…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT213",
                    "unit_title": "Operating Systems",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit213-operating-systems?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "Today's modern integrated technology is built on ICT systems that run in a range of contexts (e.g. Servers, PCs, mobile computing, robotics) using a range of technological solutions. Students will examine a range of different devices used to build ICT…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT219",
                    "unit_title": "Development Methodologies and User Experience",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit219-development-methodologies-and-user-experience?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit explores topics in Software Design and Implementation, Human-Computer Interaction and User Experience Design. You will explore the processes required for designing ICT systems that meets their functional goals but also satisfy the needs of the people who will…",
                    "unit_availability": []
                }
            ]
        },
        "Year 3": {
            "category_description": "",
            "units": [
                {
                    "unit_code": "KIT300",
                    "unit_title": "ICT Project",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit300-ict-project?year=2026",
                    "unit_credit_points": "25",
                    "unit_description": "The capstone project unit provides an opportunity for students to consolidate the knowledge and skills they have acquired in their course and apply them to a substantial ICT project. This unit extends the students development of the professional, technical, communication…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT304",
                    "unit_title": "Server Administration and Security Assurance",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit304-server-administration-and-security-assurance?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit will provide students with a general introduction to system administration, and is comprised of four modules that explore the role of an administrator in modern business settings. The four modules cover Unix administration, Windows administration, web, database and…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT325",
                    "unit_title": "Advanced Cybersecurity and eForensics",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit325-advanced-cybersecurity-and-eforensics?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit focuses on the advanced concepts and implementations of cybersecurity solutions applied in organisational settings. The unit discusses cybersecurity frameworks and incident response processes from the applied perspective of security measures. Moreover, this unit provides a capstone-like experience through…",
                    "unit_availability": []
                }
            ]
        },
        "Artificial Intelligence": {
            "category_description": "Decisions by government, industry and in science are driven by data, with the Internet of Things providing new ways of gathering even more data from our environment. This major provides you an opportunity to explore the rapidly evolving fields of artificial intelligence and internet of things. You will learn how to gather and prepare data, including the use of Internet of Things technologies, and to apply the right data mining and artificial intelligence tools for working with huge volumes of digital data to transform it into usable information.This major prepares you for a graduate career as a data mining analyst, machine learning engineer or an analyst programmer. If you are interested in a career as a data scientist or data analyst you are encouraged to do this major accompanied by some Data Handling and Statistics units such as KMA153 and KMA253 in your elective zone.",
            "units": [
                {
                    "unit_code": "KIT107",
                    "unit_title": "Programming",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit107-programming?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit extends the students' knowledge and experience of programming. It introduces dynamic data structures, foundational collection abstract data types, and computational algorithms and techniques. Programming is undertaken in Python and Java and topics include: references, memory management, self-referential data…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT108",
                    "unit_title": "Artificial Intelligence",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit108-artificial-intelligence?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "The unit provides an introduction to many AI sub-fields, including: expert systems, machine learning, natural language processing, computer vision, intelligent agents. Students will be exposed to state-of-the-art examples as well as emerging technologies and get practical experience of solving interesting…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT205",
                    "unit_title": "Data Structures and Algorithms",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit205-data-structures-and-algorithms?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit extends the first year treatment in KIT107 of standard data structures and algorithms for solving computational problems. Topics include: data structures (such as balanced trees and hash tables) for collections, (binary heaps for) priority queues, sorting algorithms (e.g.…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT217",
                    "unit_title": "Internet of Things and Distributed Artificial Intelligence",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit217-internet-of-things-and-distributed-artificial-intelligence?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "The Internet of Things (IoT) is a rising set of technologies that provides access to a large quantity of data through sensors. Such devices are ubiquitous today in industrial processes, vehicles, robots, environmental monitoring, farms, hospitals, and on our personal…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT300",
                    "unit_title": "ICT Project",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit300-ict-project?year=2026",
                    "unit_credit_points": "25",
                    "unit_description": "The capstone project unit provides an opportunity for students to consolidate the knowledge and skills they have acquired in their course and apply them to a substantial ICT project. This unit extends the students development of the professional, technical, communication…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT315",
                    "unit_title": "Machine Learning and Applications",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit315-machine-learning-and-applications?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "The aim of this unit is to provide students with the foundation knowledge and understanding of Machine Learning and its applications in various domains including computer vision, data analytics and text mining. This unit will equip students with essential knowledge…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT318",
                    "unit_title": "Big Data and Cloud Computing",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit318-big-data-and-cloud-computing?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "In recent years, due to advancement of internet technologies and instrumentation of every part of our life, we have noticed a huge surge in data available to us. This revolution is termed as Big Data. This Big Data cannot be…",
                    "unit_availability": []
                }
            ]
        },
        "Games and Creative Technology": {
            "category_description": "The Games and Creative Technology major prepares you for a career as a games designer or developer.  You will learn to design, model and program with industry leading tools and languages, included virtual and augmented reality technology that is applied in the game and multimedia industries today.",
            "units": [
                {
                    "unit_code": "KIT107",
                    "unit_title": "Programming",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit107-programming?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit extends the students' knowledge and experience of programming. It introduces dynamic data structures, foundational collection abstract data types, and computational algorithms and techniques. Programming is undertaken in Python and Java and topics include: references, memory management, self-referential data…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT109",
                    "unit_title": "Games Fundamentals",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit109-games-fundamentals?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "Games (whether they be video games, console games, computer games, mobile games, or web games) differ from other media as they elevate the viewer to the level of a participant. Games are an ever-growing cultural phenomenon which has increasing relevance…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT207",
                    "unit_title": "Game Design and Production",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit207-game-design-and-production?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit introduces the topic of game design and production. Students will work in teams to design and develop a prototype of their design using an agile development methodology. During the development process students will document aspects of the game's…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT208",
                    "unit_title": "Virtual and Mixed Reality Technology",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit208-virtual-and-mixed-reality-technology?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit will explore the exciting field of virtual reality, mixed reality and the advanced concepts and technologies for interfacing humans with complex machines. We will discuss their potential impact on the way we think about computers and the way…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT300",
                    "unit_title": "ICT Project",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit300-ict-project?year=2026",
                    "unit_credit_points": "25",
                    "unit_description": "The capstone project unit provides an opportunity for students to consolidate the knowledge and skills they have acquired in their course and apply them to a substantial ICT project. This unit extends the students development of the professional, technical, communication…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT307",
                    "unit_title": "Computer Graphics and Animation: Principles and Programming",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit307-computer-graphics-and-animation-principles-and-programming?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit will look at the creation and use of 2- and 3-dimensional graphical information and animations. The mathematical and algorithmic techniques used in generating computer graphics will be covered, as well as the programming methods to build the tools…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT327",
                    "unit_title": "Gamification and Serious Games",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit327-gamification-and-serious-games?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit will provide essential information on the growing field of gamification and serious games, as well as a practical opportunity to apply technical and behavioural methodologies to build a serious game to support a critical social issue.…",
                    "unit_availability": []
                }
            ]
        },
        "Networks and Cybersecurity": {
            "category_description": "The highly connected world we live in is filled with threats to our systems and devices. This major will enable you to get a foundational understanding of these risks, including the fundamentals of encryption systems, penetration testing, and eForensics, and how to respond to protect businesses and systems of various sizes.",
            "units": [
                {
                    "unit_code": "KIT107",
                    "unit_title": "Programming",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit107-programming?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit extends the students' knowledge and experience of programming. It introduces dynamic data structures, foundational collection abstract data types, and computational algorithms and techniques. Programming is undertaken in Python and Java and topics include: references, memory management, self-referential data…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT118",
                    "unit_title": "Introduction to Cybersecurity Policies and Practices",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit118-introduction-to-cybersecurity-policies-and-practices?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit explores cybersecurity as it is managed in the business context. It covers the processes of threat and risk analysis, security policy development, incident prevention and response, issues around privacy, professional codes of conduct, and looks at legislative efforts…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT215",
                    "unit_title": "CyberSecurity and Ethical Hacking",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit215-cybersecurity-and-ethical-hacking?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit gives an introduction to the risks and threats to computer systems and some of the countermeasures that can be put in place to minimise them. Students will develop an understanding of the ethical and privacy issues relating to…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT216",
                    "unit_title": "Network Administration and Security",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit216-network-administration-and-security?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit builds on the fundamentals of distributed networked environments explored in KIT111 Data Networks and Security and extends your knowledge of internetworking standards to consider advanced topics such as network scalability, quality of service, reliability and fault tolerance, efficiency,…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT300",
                    "unit_title": "ICT Project",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit300-ict-project?year=2026",
                    "unit_credit_points": "25",
                    "unit_description": "The capstone project unit provides an opportunity for students to consolidate the knowledge and skills they have acquired in their course and apply them to a substantial ICT project. This unit extends the students development of the professional, technical, communication…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT304",
                    "unit_title": "Server Administration and Security Assurance",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit304-server-administration-and-security-assurance?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit will provide students with a general introduction to system administration, and is comprised of four modules that explore the role of an administrator in modern business settings. The four modules cover Unix administration, Windows administration, web, database and…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT325",
                    "unit_title": "Advanced Cybersecurity and eForensics",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit325-advanced-cybersecurity-and-eforensics?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit focuses on the advanced concepts and implementations of cybersecurity solutions applied in organisational settings. The unit discusses cybersecurity frameworks and incident response processes from the applied perspective of security measures. Moreover, this unit provides a capstone-like experience through…",
                    "unit_availability": []
                }
            ]
        },
        "Core Units": {
            "category_description": "",
            "units": [
                {
                    "unit_code": "KIT101",
                    "unit_title": "Programming Fundamentals",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit101-programming-fundamentals?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit introduces fundamental programming skills, developing students' ability to think algorithmically to solve problems and to express their ideas in well-constructed Python code. Beginning with the fundamental characteristics of computers and how they represent information, the unit develops the…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT105",
                    "unit_title": "ICT Professional Practices",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit105-ict-professional-practices?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "An undergraduate student needs to acquire an understanding of the vast and diverse nature of the ICT industry to plan and manage a successful career. Students develop awareness of the skills, attributes, qualities and values required of ICT professionals. Students…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT111",
                    "unit_title": "Data Networks and Security",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit111-data-networks-and-security?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit introduces students to fundamentals of distributed networked environments, primarily focusing on wired networks but students will examine some of the different approaches in wireless networks. It provides knowledge of internetworking standards and understanding of the networking architecture, technology…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT119",
                    "unit_title": "Database Fundamentals",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit119-database-fundamentals?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit will familiarise you with the fundamental concepts of database design and implementation techniques to define, construct and query a database. In this unit you will develop basic skills in data modelling using relational data models and normalisation to…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT202",
                    "unit_title": "Web Programming Fundamentals",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit202-web-programming-fundamentals?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit introduces students to the technologies that make up the fabric of the web—HTML, CSS and JavaScript—as well as standard web models and practices, key web design and usability principles, common security issues and mitigation strategies, and data-driven backend…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT203",
                    "unit_title": "ICT Project Management and Modelling",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit203-ict-project-management-and-modelling?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit provides both a theoretical and practical overview of project management as it relates to technology-oriented projects. Specifically, this unit will introduce project management principles, techniques and tools that can be used to guide traditional business-oriented ICT projects, as…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT213",
                    "unit_title": "Operating Systems",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit213-operating-systems?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "Today's modern integrated technology is built on ICT systems that run in a range of contexts (e.g. Servers, PCs, mobile computing, robotics) using a range of technological solutions. Students will examine a range of different devices used to build ICT…",
                    "unit_availability": []
                },
                {
                    "unit_code": "KIT219",
                    "unit_title": "Development Methodologies and User Experience",
                    "unit_details_link": "https://www.utas.edu.au/courses/cse/units/kit219-development-methodologies-and-user-experience?year=2026",
                    "unit_credit_points": "12.5",
                    "unit_description": "This unit explores topics in Software Design and Implementation, Human-Computer Interaction and User Experience Design. You will explore the processes required for designing ICT systems that meets their functional goals but also satisfy the needs of the people who will…",
                    "unit_availability": []
                }
            ]
        },
        "Elective Units": {
            "category_description": "2 electives are normally selected in Years 1 and Year 2 and 4 electives in Year 3  In your Elective component you can choose from any units marked as \"Student Electives\" which you meet the pre-requisites for, at any level, from across the university.",
            "units": []
        }
    }
}