{
    "title": "Master of Information Technology and Systems (K7I)",
    "overview": "IT professionals are in demand across a range of industries including Information Technology, Telecommunications Technology and Digital Media with increasing skill demands in Artificial Intelligence (AI), Internet of Things (IoT), and Automation Technologies.* A career in IT could see you starting your own business, to working for international companies such as IBM, Intel, Microsoft, and Samsung.\nThe Master of Information Technology and Systems (MITS) provides a wide breadth of knowledge and practical skills in varying aspects of information technology (IT) and information systems (IS). It has been designed for everyone, not just those with IT backgrounds, to develop and build on your current skills, and enhance your ability to contribute to the workforce in any industry that has information technology and system needs.\nYou will have the option to customise your own learning towards your career goals with a range of seven specialisations. You can select up to two specialisations that cover a range of advanced IT and IS areas. You will develop the critical knowledge and skills required to work as an IT professional by choosing units that best suit your career development, interests and needs.\nIt is forecasted that there will be 1.1 million technology workers in Australia by 2026. ^\nWith an industry expecting very strong growth within the next five years, IT remains one of the highest paid industries in Australia with career options looking more promising than ever.*\n*Australian Industry and Skills Committee, Information and Communications Technology, 2021\n^ACS Australia’s Digital Pulse: future directions for Australia's technology workforce - Deloitte Access Economics\nSpecialisations available\nHobart\nMelbourne*\nUltimo*\nCybersecurity\nCybersecurity is available in Hobart\nCybersecurity is not available in Melbourne\nCybersecurity is not available in Ultimo\nData Analytics and Artificial Intelligence\nData Analytics and Artificial Intelligence is available in Hobart\nData Analytics and Artificial Intelligence is available in Melbourne\nData Analytics and Artificial Intelligence is available in Ultimo\nSoftware Development\nSoftware Development is available in Hobart\nSoftware Development is not available in Melbourne\nSoftware Development is not available in Ultimo\nSystems Analysis\nSystems Analysis is available in Hobart\nSystems Analysis is available in Melbourne\nSystems Analysis is available in Ultimo\n*The\nMelbourne Study Centre\nand\nUltimo Study Centre\nare available to international students only.\nJoin our webinar (International students)\nIn this session, the course coordinators for both the Bachelor of ICT and the Master of ICT will discuss how these degrees will give your students a high level of technical expertise to enable them to succeed as an information technology or systems professional in any industry.\nWatch now (YouTube)",
    "duration": "Minimum 2 years, up to a maximum of 5 years.",
    "course_objectives": "This course provides a foundation of Information Technology and Information System skills for entrants with limited IT experience. It also provides opportunities for experienced Information Technology and Systems professionals to enhance and apply their skills within emerging technology driven growth areas.\nYou will learn how to apply Information Systems and Technologies in meeting current business needs in a real-world environment by integrating theoretical learnings with the practical application and experiences learnt through working on projects with real clients.\nYou will graduate with relevant practical experiences to help you hit the ground running into a successful and exciting career in your chosen field.\nMITS also provides an optional opportunity for high achieving students to qualify to participate in a research project, offering valuable experience for your future career, or potentially being the first step on your path to a PhD.",
    "learning_outcomes": "1 Communicate technical and non-technical information proficiently to a variety of stakeholders in ICT professional practice\n2 Adapt ICT processes, tools, and techniques to efficiently solve complex and diverse problems incorporating best practice and ICT industry standards\n3 Construct efficient ICT solutions ensuring a quality user experience using peer collaboration and research in areas of specialisation\n4 Propose and critique effective, ethical solutions to complex scenarios considering the consequences for individuals, organisations, and society that are relevant to areas of specialisation",
    "practical_experience": "",
    "work_placement": "",
    "entry_requirements": "",
    "career_outcomes": "",
    "fees": "",
    "structure": ""
}